{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[MASK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[UNK]": 4,
      "A": 5,
      "C": 6,
      "G": 7,
      "K": 8,
      "M": 9,
      "N": 10,
      "R": 11,
      "S": 12,
      "T": 13,
      "W": 14,
      "Y": 15,
      "GC": 16,
      "AA": 17,
      "TT": 18,
      "TC": 19,
      "GA": 20,
      "GG": 21,
      "CC": 22,
      "TA": 23,
      "TG": 24,
      "CA": 25,
      "GGC": 26,
      "TGC": 27,
      "AAA": 28,
      "GCC": 29,
      "TAA": 30,
      "TCA": 31,
      "TGA": 32,
      "GCA": 33,
      "GAA": 34,
      "GTT": 35,
      "TGG": 36,
      "TTA": 37,
      "TTC": 38,
      "GTC": 39,
      "GAC": 40,
      "CCA": 41,
      "TCC": 42,
      "GGA": 43,
      "TTTT": 44,
      "TAC": 45,
      "AAC": 46,
      "GTA": 47,
      "GCGC": 48,
      "CCC": 49,
      "TAAA": 50,
      "AAAA": 51,
      "GTG": 52,
      "CAC": 53,
      "TGCA": 54,
      "TGCC": 55,
      "TATT": 56,
      "GGCC": 57,
      "TGGC": 58,
      "GGCA": 59,
      "GATC": 60,
      "TGAA": 61,
      "GAAA": 62,
      "GCCA": 63,
      "TCAA": 64,
      "GCCC": 65,
      "TGTT": 66,
      "TCTT": 67,
      "GACC": 68,
      "GCGG": 69,
      "GATT": 70,
      "TCCA": 71,
      "GCAA": 72,
      "GCTT": 73,
      "GTGC": 74,
      "TGAC": 75,
      "GGAA": 76,
      "GTCA": 77,
      "TCGA": 78,
      "GTAA": 79,
      "GCAC": 80,
      "TGGA": 81,
      "GCGA": 82,
      "GTTC": 83,
      "GAAC": 84,
      "GGTT": 85,
      "TACC": 86,
      "TATC": 87,
      "GCTC": 88,
      "GGTC": 89,
      "TTCA": 90,
      "AAAC": 91,
      "GTGG": 92,
      "GTGA": 93,
      "TCAC": 94,
      "TTAC": 95,
      "TATA": 96,
      "GGAC": 97,
      "TTAA": 98,
      "GTCC": 99,
      "TGTC": 100,
      "GTTA": 101,
      "TTCC": 102,
      "TACA": 103,
      "GGGC": 104,
      "TAAC": 105,
      "GACA": 106,
      "TAAAA": 107,
      "TTTC": 108,
      "GCGGC": 109,
      "CCAC": 110,
      "TTGA": 111,
      "TTTA": 112,
      "TCCC": 113,
      "CACC": 114,
      "GCGCC": 115,
      "GTAC": 116,
      "TCGG": 117,
      "TGTA": 118,
      "TGGCC": 119,
      "GATA": 120,
      "GCTGC": 121,
      "GAAAA": 122,
      "GAGG": 123,
      "TCGGC": 124,
      "TTCAA": 125,
      "CCAA": 126,
      "TCGC": 127,
      "GAGC": 128,
      "GCACC": 129,
      "TGAAA": 130,
      "TTGG": 131,
      "TCACC": 132,
      "TTGC": 133,
      "TGGAA": 134,
      "TCGCC": 135,
      "GGCCA": 136,
      "GGTA": 137,
      "GAGA": 138,
      "TTATT": 139,
      "GGGG": 140,
      "TGACC": 141,
      "TCTC": 142,
      "TGCCC": 143,
      "GGCAA": 144,
      "GCCGG": 145,
      "TTCTT": 146,
      "GCGCA": 147,
      "AACAA": 148,
      "TGGCA": 149,
      "CATC": 150,
      "GCCGA": 151,
      "TGCAA": 152,
      "CATT": 153,
      "GCCAA": 154,
      "GGCGA": 155,
      "GGCGG": 156,
      "GGCCC": 157,
      "GTAAA": 158,
      "GGGA": 159,
      "TAATT": 160,
      "GTTTT": 161,
      "GCCGC": 162,
      "GTGCC": 163,
      "CCACC": 164,
      "TCGTC": 165,
      "TGCAC": 166,
      "CAGC": 167,
      "GACAA": 168,
      "TAGA": 169,
      "TGTTC": 170,
      "GGTGC": 171,
      "TACAA": 172,
      "TGATT": 173,
      "GGCAC": 174,
      "GACGA": 175,
      "TCCAA": 176,
      "GGCGC": 177,
      "TCATC": 178,
      "TGAAC": 179,
      "TAGC": 180,
      "TATAA": 181,
      "TGCCA": 182,
      "TAAAC": 183,
      "GTGAA": 184,
      "TATTA": 185,
      "TGATC": 186,
      "GAACA": 187,
      "TCATT": 188,
      "GTTCC": 189,
      "GAAAC": 190,
      "GTGCA": 191,
      "GAACC": 192,
      "AAATT": 193,
      "GTCGA": 194,
      "TTACC": 195,
      "TATTTT": 196,
      "GCTGG": 197,
      "GCAGG": 198,
      "TGGAC": 199,
      "TGTAA": 200,
      "GAAGA": 201,
      "AAAAAA": 202,
      "CAGG": 203,
      "GCAGC": 204,
      "GCCCA": 205,
      "GAATT": 206,
      "GGACC": 207,
      "TGCTT": 208,
      "TTTTTT": 209,
      "TCAAA": 210,
      "TGTCC": 211,
      "GTCAA": 212,
      "GTTAA": 213,
      "TAAAAA": 214,
      "GGTGA": 215,
      "GTTCA": 216,
      "GCCGCC": 217,
      "GGAAA": 218,
      "TGGTT": 219,
      "GGCGGC": 220,
      "GCGTC": 221,
      "GATGA": 222,
      "GCAAA": 223,
      "TGTGC": 224,
      "GCATC": 225,
      "GATGC": 226,
      "TGGCGC": 227,
      "TTATC": 228,
      "GATCA": 229,
      "GAAAAA": 230,
      "GATAA": 231,
      "TATCA": 232,
      "GCTTC": 233,
      "CCCC": 234,
      "GCATT": 235,
      "TCGAC": 236,
      "GCTGA": 237,
      "GGTGG": 238,
      "TCCTT": 239,
      "GGTCA": 240,
      "GGATT": 241,
      "TGTCA": 242,
      "TGAAAA": 243,
      "GACCA": 244,
      "GGCTT": 245,
      "TGTGG": 246,
      "GCTA": 247,
      "GCCTT": 248,
      "GCGAC": 249,
      "GTATT": 250,
      "GCCAC": 251,
      "TGTTTT": 252,
      "TCTTC": 253,
      "GTCCA": 254,
      "GCCCC": 255,
      "TCTA": 256,
      "TACTT": 257,
      "GCGGA": 258,
      "CCTT": 259,
      "GGGCA": 260,
      "CACA": 261,
      "TGTTA": 262,
      "GTGAC": 263,
      "GAGCA": 264,
      "TTTTAA": 265,
      "GCGAA": 266,
      "GCAAC": 267,
      "GGGCC": 268,
      "GTCAC": 269,
      "GATCC": 270,
      "CCCA": 271,
      "TGCTC": 272,
      "GCGTT": 273,
      "TACCA": 274,
      "TATTC": 275,
      "TAGG": 276,
      "GATGG": 277,
      "GTACC": 278,
      "GGACA": 279,
      "GGATC": 280,
      "AATT": 281,
      "TTACA": 282,
      "TGGTC": 283,
      "CCGG": 284,
      "TGCGG": 285,
      "TGTAC": 286,
      "GAGAA": 287,
      "TAATA": 288,
      "GCTCA": 289,
      "TTATA": 290,
      "TGACA": 291,
      "GTTAC": 292,
      "TCCGG": 293,
      "GTAAC": 294,
      "AAACA": 295,
      "TCCTC": 296,
      "GTGTT": 297,
      "GCACA": 298,
      "GTTTC": 299,
      "TAACA": 300,
      "GAGGA": 301,
      "GCCGGC": 302,
      "TGCTGC": 303,
      "TGTGA": 304,
      "AACTT": 305,
      "GAAGG": 306,
      "GTCTT": 307,
      "CACAA": 308,
      "TTCTC": 309,
      "AAACC": 310,
      "GACGG": 311,
      "CCCAA": 312,
      "GTCGG": 313,
      "TAACC": 314,
      "GTCCC": 315,
      "GCTCC": 316,
      "TATTAA": 317,
      "TATGA": 318,
      "CCATT": 319,
      "GTTGA": 320,
      "GCGCCC": 321,
      "GCAGCA": 322,
      "GACCC": 323,
      "TAGAA": 324,
      "GAGGC": 325,
      "GCGGCC": 326,
      "GCGCCA": 327,
      "GACTT": 328,
      "GGCACC": 329,
      "TCAAC": 330,
      "GCCACC": 331,
      "GAGTT": 332,
      "GGAAC": 333,
      "GTACA": 334,
      "TATCC": 335,
      "TAGTT": 336,
      "AACC": 337,
      "GCCTC": 338,
      "GGGGC": 339,
      "TAATC": 340,
      "GAAGAA": 341,
      "AACA": 342,
      "GCCGTC": 343,
      "TAAATT": 344,
      "TTCTTC": 345,
      "TATGC": 346,
      "GGTAA": 347,
      "GATTA": 348,
      "GGGTT": 349,
      "GGCTC": 350,
      "GATTC": 351,
      "GGTTC": 352,
      "GCTG": 353,
      "GAGCC": 354,
      "TAATAA": 355,
      "GAATC": 356,
      "CCATC": 357,
      "GACGGC": 358,
      "TATGG": 359,
      "TCACA": 360,
      "GATTTT": 361,
      "GTATC": 362,
      "GCTGGC": 363,
      "GGGTC": 364,
      "AAATC": 365,
      "GGGAA": 366,
      "TTATTA": 367,
      "AAATA": 368,
      "CCACA": 369,
      "GATCAA": 370,
      "TGGATT": 371,
      "TAAAAAA": 372,
      "GATAC": 373,
      "GCTTTT": 374,
      "GTAAAA": 375,
      "TGATA": 376,
      "GCCTGC": 377,
      "TGGCAA": 378,
      "GCCGAC": 379,
      "GTCGGC": 380,
      "GCGTG": 381,
      "GCTAC": 382,
      "GCAAAA": 383,
      "CACTT": 384,
      "TTTTCA": 385,
      "GATG": 386,
      "GGTCC": 387,
      "TTTTTC": 388,
      "TCATCA": 389,
      "TGCTGG": 390,
      "GCACCA": 391,
      "TTTTA": 392,
      "GCGGCA": 393,
      "GCAGGC": 394,
      "TTAAA": 395,
      "TACCC": 396,
      "TGGCCA": 397,
      "GGGGA": 398,
      "TGATGA": 399,
      "TATAC": 400,
      "TCGAA": 401,
      "GCTAA": 402,
      "TCGTT": 403,
      "GCGATC": 404,
      "TGCACC": 405,
      "TGCCAA": 406,
      "GTCACC": 407,
      "GCCGGA": 408,
      "TCTTCA": 409,
      "TTGTT": 410,
      "AAACAA": 411,
      "TCAGG": 412,
      "TGGATC": 413,
      "TGGCCC": 414,
      "GATGAA": 415,
      "TCTGC": 416,
      "TCCACC": 417,
      "TTTTCC": 418,
      "TTCAAA": 419,
      "TGTATT": 420,
      "GCGTA": 421,
      "GCTTA": 422,
      "TCCGGC": 423,
      "TTCGG": 424,
      "TTCGA": 425,
      "GCTGCC": 426,
      "TGGTGG": 427,
      "GCGCAA": 428,
      "GAATA": 429,
      "GCGACC": 430,
      "GTTGG": 431,
      "GCCGCA": 432,
      "GTCGTC": 433,
      "TCTTCC": 434,
      "TGCGGC": 435,
      "TATATT": 436,
      "GCCGAA": 437,
      "TTACAA": 438,
      "GGCCAA": 439,
      "GGGTG": 440,
      "TTCCA": 441,
      "GACGAC": 442,
      "GAACAA": 443,
      "GCAGA": 444,
      "TATAAA": 445,
      "TGTTCC": 446,
      "TTTCA": 447,
      "TTGAA": 448,
      "TATCAA": 449,
      "TGTG": 450,
      "TGGTGC": 451,
      "GGTAC": 452,
      "TCCAC": 453,
      "TCCTGC": 454,
      "TCCCC": 455,
      "GCCGTT": 456,
      "GGCGTC": 457,
      "TTTTC": 458,
      "GCAGGA": 459,
      "GCGGAA": 460,
      "TAAAAC": 461,
      "GACAC": 462,
      "TGATGC": 463,
      "GATATT": 464,
      "TAGTA": 465,
      "TGGAAA": 466,
      "GATAAA": 467,
      "GCATCA": 468,
      "GGGCGC": 469,
      "GTTCAA": 470,
      "TGTAAA": 471,
      "GCCTTC": 472,
      "TTTAA": 473,
      "GCTGAA": 474,
      "TAACAA": 475,
      "TGAAAC": 476,
      "GCTTCA": 477,
      "GAAACC": 478,
      "GGCGAC": 479,
      "TGGACC": 480,
      "TACCAA": 481,
      "TCACCA": 482,
      "GCCGCGC": 483,
      "TTATTTT": 484,
      "TGTTAA": 485,
      "TGTTCA": 486,
      "GGAAAA": 487,
      "GATGCC": 488,
      "GCTTCC": 489,
      "TCCCA": 490,
      "GCTGCA": 491,
      "TAGCA": 492,
      "TGATAA": 493,
      "GTTGTT": 494,
      "TCTCC": 495,
      "GGCTGC": 496,
      "GAGCGC": 497,
      "GGCGCC": 498,
      "TGATCA": 499,
      "GAGTA": 500,
      "TTATCA": 501,
      "GTGCCC": 502,
      "TTATAA": 503,
      "TGGTA": 504,
      "TGACCA": 505,
      "GGCGAA": 506,
      "GAAATT": 507,
      "TGTCGA": 508,
      "TCAACA": 509,
      "AAATAA": 510,
      "TACAC": 511,
      "TCTTTT": 512,
      "GGCGGA": 513,
      "TATTCA": 514,
      "GCACCC": 515,
      "GATCCC": 516,
      "TTCACC": 517,
      "TGACAA": 518,
      "GCCAAA": 519,
      "GGTGCC": 520,
      "GATCCA": 521,
      "TCTGG": 522,
      "GGCGTT": 523,
      "GAGAC": 524,
      "TCAACC": 525,
      "TCGGCC": 526,
      "TGAACA": 527,
      "GTGGAA": 528,
      "GGCGCA": 529,
      "GCGTGC": 530,
      "GGCAAA": 531,
      "GAAAAAA": 532,
      "GCTGTT": 533,
      "CCCTT": 534,
      "GGGAC": 535,
      "GATGGC": 536,
      "CCACCA": 537,
      "TGATGG": 538,
      "TGAATT": 539,
      "GCAACA": 540,
      "TGTCCA": 541,
      "TCAAAA": 542,
      "GGTGGC": 543,
      "TCGCCC": 544,
      "GCTGGA": 545,
      "TATCTT": 546,
      "GGGTA": 547,
      "TGAACC": 548,
      "TTCAAC": 549,
      "GGTTTT": 550,
      "TCGGA": 551,
      "GTGACC": 552,
      "GACACC": 553,
      "GCAACC": 554,
      "TATTCC": 555,
      "TGAAAAA": 556,
      "GGTTA": 557,
      "GCACAA": 558,
      "GTGGA": 559,
      "GCAGTT": 560,
      "TCATA": 561,
      "GAAAAC": 562,
      "GATTAA": 563,
      "GGCTTC": 564,
      "TGATCC": 565,
      "GCCTGG": 566,
      "TCAATT": 567,
      "TCGACC": 568,
      "GCCGCCC": 569,
      "GCGCAC": 570,
      "GGATA": 571,
      "TCGACA": 572,
      "GGACAA": 573,
      "TACAAA": 574,
      "TTCTGC": 575,
      "GCCAAC": 576,
      "TCAGCA": 577,
      "GAAACA": 578,
      "TGTCTT": 579,
      "GAAGTT": 580,
      "GAGTC": 581,
      "TTTGC": 582,
      "GCGACA": 583,
      "GGCCAC": 584,
      "GACCAA": 585,
      "TGGCAC": 586,
      "TCGCGC": 587,
      "TGTGGC": 588,
      "GGCCCA": 589,
      "TTCTTTT": 590,
      "GCCCCA": 591,
      "GGAACA": 592,
      "GCTCCA": 593,
      "GGATGC": 594,
      "GGCTGG": 595,
      "TCTAC": 596,
      "TAATTTT": 597,
      "GTTTA": 598,
      "TCACCC": 599,
      "GCCCCC": 600,
      "TCGCA": 601,
      "TCGTA": 602,
      "TGGAAC": 603,
      "TGTGCC": 604,
      "GTCGAC": 605,
      "GGCAAC": 606,
      "GCCATT": 607,
      "GTGAAA": 608,
      "AAAACC": 609,
      "GATTCC": 610,
      "GGGCGG": 611,
      "TGCCCA": 612,
      "GGATCA": 613,
      "GGAGA": 614,
      "TACACC": 615,
      "TGTGCA": 616,
      "GCAGAA": 617,
      "GTCGCC": 618,
      "GTTTTA": 619,
      "GGGCGA": 620,
      "GCCCAA": 621,
      "GCTCAA": 622,
      "GACCCC": 623,
      "TCCAAA": 624,
      "GTTCCA": 625,
      "GAGGCC": 626,
      "TGCTGA": 627,
      "GCAATT": 628,
      "GGCATT": 629,
      "TAAACA": 630,
      "GTTAAA": 631,
      "GCATA": 632,
      "GGCGGCC": 633,
      "TGGTGA": 634,
      "TGCAAA": 635,
      "AACAAA": 636,
      "GGTCGA": 637,
      "TGGTCA": 638,
      "TCACAA": 639,
      "AAAATT": 640,
      "GACGCC": 641,
      "GGTGAA": 642,
      "TTCGTC": 643,
      "TTCTA": 644,
      "TAAACC": 645,
      "TCTAA": 646,
      "GACGAA": 647,
      "GCATCC": 648,
      "TGGACA": 649,
      "GCGTTC": 650,
      "GGCGCGC": 651,
      "GCGATT": 652,
      "GCTCTT": 653,
      "GGCCTT": 654,
      "GGCCCC": 655,
      "TGATTTT": 656,
      "GACAAA": 657,
      "GGTTCA": 658,
      "GGAGG": 659,
      "GTGTC": 660,
      "GTTGAA": 661,
      "GCGTCA": 662,
      "TTAATT": 663,
      "GCGTCC": 664,
      "TGACCC": 665,
      "GCAGCC": 666,
      "GTGCCA": 667,
      "GACGTC": 668,
      "TGCGCC": 669,
      "GTAAAC": 670,
      "GGAGAA": 671,
      "TTCTCC": 672,
      "GATGTT": 673,
      "TTACTT": 674,
      "TGTACC": 675,
      "TTCCAA": 676,
      "GCTGAC": 677,
      "TGTGTT": 678,
      "TCTTA": 679,
      "GCGAAC": 680,
      "GATTCA": 681,
      "GCGGAC": 682,
      "GTGCAC": 683,
      "TTTTTTA": 684,
      "GATCTT": 685,
      "GGAACC": 686,
      "GCCACA": 687,
      "GGAATT": 688,
      "TTTTTA": 689,
      "TCGGCA": 690,
      "GGTTCC": 691,
      "AAAAAAA": 692,
      "TTCGGC": 693,
      "GCAGCGC": 694,
      "GCTCGA": 695,
      "CCCGG": 696,
      "GCTCCC": 697,
      "TCTTAA": 698,
      "TCCGCC": 699,
      "TCTCA": 700,
      "GCTATT": 701,
      "GGCCGG": 702,
      "GTTCTT": 703,
      "GTGCAA": 704,
      "GTTATT": 705,
      "GTATA": 706,
      "GCCCAC": 707,
      "TGGCTT": 708,
      "TTCTGG": 709,
      "GCGTGG": 710,
      "TTCGCC": 711,
      "GCTGTC": 712,
      "TTACCA": 713,
      "AAAACA": 714,
      "TCTGA": 715,
      "GTTTCA": 716,
      "GGATGA": 717,
      "TGTCAA": 718,
      "GCGCTT": 719,
      "GTCGAA": 720,
      "GAGATC": 721,
      "GCGAAA": 722,
      "TGTGAA": 723,
      "TAATTA": 724,
      "GAGAAA": 725,
      "AAAGAA": 726,
      "AACAAC": 727,
      "GTGGCC": 728,
      "TATCCC": 729,
      "GGGCAA": 730,
      "GCTAAA": 731,
      "TAGGA": 732,
      "GAGCTT": 733,
      "GAGGAA": 734,
      "GATGAC": 735,
      "GGTGCA": 736,
      "GGTATT": 737,
      "TCGATC": 738,
      "GATGCA": 739,
      "TCATCC": 740,
      "GGGCCA": 741,
      "TTCTAA": 742,
      "GCCGGCC": 743,
      "GGTGTT": 744,
      "TGCCTT": 745,
      "GGCACA": 746,
      "TCATAA": 747,
      "TATGAA": 748,
      "GTGAAC": 749,
      "TCGCCA": 750,
      "GCCGTA": 751,
      "TGTGGA": 752,
      "GAACCA": 753,
      "GGCGCGG": 754,
      "TGTATC": 755,
      "TCCTCC": 756,
      "TCCATT": 757,
      "TGCGCA": 758,
      "TCGCGG": 759,
      "GGTTAA": 760,
      "GCCCTT": 761,
      "TGCAAC": 762,
      "GCGTGA": 763,
      "GAGCAA": 764,
      "TTCAAAA": 765,
      "CCAGCA": 766,
      "GCTTAA": 767,
      "GTCAAA": 768,
      "TTCGTT": 769,
      "TAGCC": 770,
      "TGATTA": 771,
      "GGAGGA": 772,
      "GGTGAC": 773,
      "GGTAAA": 774,
      "TTCATT": 775,
      "TCCTGG": 776,
      "GTTACC": 777,
      "TACAAC": 778,
      "GTAATT": 779,
      "TGCCCC": 780,
      "GACCTT": 781,
      "GAGCGG": 782,
      "GCAAAC": 783,
      "TGTACA": 784,
      "TCATTA": 785,
      "TAACTT": 786,
      "TGCATT": 787,
      "GCCGCCA": 788,
      "TTTTAAA": 789,
      "TGCACA": 790,
      "GAAGGC": 791,
      "GTACAA": 792,
      "TCAAAAA": 793,
      "GAATAA": 794,
      "TAGTC": 795,
      "TTTCCC": 796,
      "TCCACA": 797,
      "TGGTAA": 798,
      "TGAGTT": 799,
      "CCACAA": 800,
      "TGGGCA": 801,
      "TCGTG": 802,
      "GACAAC": 803,
      "GAAGTA": 804,
      "TCAGGA": 805,
      "TAAAATT": 806,
      "TGTCCC": 807,
      "TCAGTT": 808,
      "GGGTGC": 809,
      "GAACTT": 810,
      "TATACA": 811,
      "GCTGGCC": 812,
      "GAGTG": 813,
      "GCGGTT": 814,
      "GGCGATC": 815,
      "TGAGCA": 816,
      "GAATTA": 817,
      "TGCTCA": 818,
      "TATTTTA": 819,
      "GTTTTC": 820,
      "GGACCA": 821,
      "TGCCAC": 822,
      "GCTACC": 823,
      "GGTCCC": 824,
      "GTCCAA": 825,
      "GACCCA": 826,
      "GGGCTT": 827,
      "TTCGAC": 828,
      "GGCTGA": 829,
      "CACCAA": 830,
      "GATCAC": 831,
      "GTTTAA": 832,
      "GATACC": 833,
      "TCCAAC": 834,
      "TTAAAAA": 835,
      "TGTATA": 836,
      "GTGTA": 837,
      "GCGGCCC": 838,
      "GGCGTA": 839,
      "GAGCAC": 840,
      "GACCAC": 841,
      "TACTC": 842,
      "TCCTGA": 843,
      "GGATAA": 844,
      "GTCGTT": 845,
      "GGGTGA": 846,
      "GAACCC": 847,
      "TTTTTAA": 848,
      "TATTAAA": 849,
      "TATCCA": 850,
      "GGTCAA": 851,
      "GAGGTC": 852,
      "GATGTC": 853,
      "TTCTTA": 854,
      "AAACTT": 855,
      "GAGATT": 856,
      "GAAGCA": 857,
      "GAAGCC": 858,
      "GAAGGA": 859,
      "GTAACC": 860,
      "TAGAAA": 861,
      "TAAAAAAA": 862,
      "TCACTT": 863,
      "GGTGGA": 864,
      "GGTCTT": 865,
      "TCCGGA": 866,
      "GTCCAC": 867,
      "GCGGCCA": 868,
      "GACGTT": 869,
      "GGCGGCA": 870,
      "TGTTAC": 871,
      "TTCTTCA": 872,
      "TCGGCCA": 873,
      "GATATC": 874,
      "TGTAAC": 875,
      "GTCAAC": 876,
      "TAATGA": 877,
      "GTGATT": 878,
      "TCCCAA": 879,
      "GTCATT": 880,
      "GCCTGA": 881,
      "TTCTAC": 882,
      "GTTTTTT": 883,
      "TGCGGA": 884,
      "TTCCTT": 885,
      "TAATAAA": 886,
      "TCCCCC": 887,
      "TAGAC": 888,
      "GCCGACC": 889,
      "TTAACA": 890,
      "GAACAC": 891,
      "TGCTCC": 892,
      "GAGCCC": 893,
      "TACATT": 894,
      "TTCCCC": 895,
      "GATGGA": 896,
      "GTACCA": 897,
      "TGCCGG": 898,
      "GAAGTC": 899,
      "GAGGAC": 900,
      "GCCTCC": 901,
      "TATGTT": 902,
      "GGAGTT": 903,
      "GCCGTG": 904,
      "GCATTA": 905,
      "CCCGGC": 906,
      "TGCTTC": 907,
      "GTCCTT": 908,
      "TACCCA": 909,
      "GCAGGCC": 910,
      "TACCTT": 911,
      "GAATAC": 912,
      "TATTAC": 913,
      "GCATGG": 914,
      "TATTTC": 915,
      "GCAAAAA": 916,
      "GCGCTGC": 917,
      "TAATCA": 918,
      "TTATGA": 919,
      "TAGGC": 920,
      "GTGCTT": 921,
      "TAATAC": 922,
      "GAGTTC": 923,
      "TGTCAC": 924,
      "GAGCCA": 925,
      "GGGGCC": 926,
      "CCATCA": 927,
      "TATATC": 928,
      "GGTGTC": 929,
      "GAAGAC": 930,
      "GTGGTT": 931,
      "TCCTTC": 932,
      "TGCGTT": 933,
      "GGCGTG": 934,
      "TTTTTCA": 935,
      "GTATTA": 936,
      "TATGGC": 937,
      "GGAAAAA": 938,
      "TGTAAAA": 939,
      "TGGAAAA": 940,
      "GAATCA": 941,
      "TGACTT": 942,
      "GGGAAA": 943,
      "GTTCAC": 944,
      "GGGATC": 945,
      "TCCGCA": 946,
      "GGCATC": 947,
      "GGCGACC": 948,
      "TTATTAA": 949,
      "GCACTT": 950,
      "GCGCACC": 951,
      "TGATGAA": 952,
      "GGATGG": 953,
      "GCTGCCC": 954,
      "GTCTC": 955,
      "GCTATC": 956,
      "TATGCC": 957,
      "GTCTTC": 958,
      "GGCCACC": 959,
      "GGTCCA": 960,
      "TCGACCA": 961,
      "GCTCAC": 962,
      "TAAGTT": 963,
      "TGATAC": 964,
      "TCATGG": 965,
      "TTAGTT": 966,
      "GATATA": 967,
      "TAGTG": 968,
      "GCAGTA": 969,
      "GAGACC": 970,
      "GCCGATC": 971,
      "TTCCCA": 972,
      "TAATGC": 973,
      "TGGCCAA": 974,
      "GCGGCAA": 975,
      "GGGATT": 976,
      "GGCTCA": 977,
      "GTTACA": 978,
      "TGGGTT": 979,
      "GGGCAC": 980,
      "TTCTGA": 981,
      "TACCCC": 982,
      "GTAACA": 983,
      "GGGTGG": 984,
      "TAAATAA": 985,
      "TGAACAA": 986,
      "GTAAAAA": 987,
      "GCATGC": 988,
      "GAGGTT": 989,
      "TGGGCC": 990,
      "TACTGC": 991,
      "TCCCCA": 992,
      "GACTC": 993,
      "TCCGTT": 994,
      "GGATTA": 995,
      "GCATGA": 996,
      "GTAGTT": 997,
      "TCATGC": 998,
      "TGAAAAAA": 999,
      "GTCTGC": 1000,
      "GAAGAAA": 1001,
      "GACTTC": 1002,
      "TGTTCAA": 1003,
      "GATAAC": 1004,
      "TACTTC": 1005,
      "GCCATC": 1006,
      "TCATCAA": 1007,
      "TAAAACA": 1008,
      "TAAACAA": 1009,
      "GCGCGGC": 1010,
      "TCCGTC": 1011,
      "GATACA": 1012,
      "GGGTCA": 1013,
      "GGAGCA": 1014,
      "GCCGGCA": 1015,
      "TAACCA": 1016,
      "TATTTA": 1017,
      "GAGCTC": 1018,
      "GACATT": 1019,
      "TGGTAC": 1020,
      "AAATTA": 1021,
      "TCATGA": 1022,
      "TCGGCAA": 1023,
      "TGGTTC": 1024,
      "GTGGAC": 1025,
      "GTCCCA": 1026,
      "GTTTGC": 1027,
      "GTTCCC": 1028,
      "GCCGCGG": 1029,
      "GTCGTA": 1030,
      "TAGCAA": 1031,
      "GGCTCC": 1032,
      "GAGAAC": 1033,
      "GTTTGA": 1034,
      "GAATGC": 1035,
      "GGACCC": 1036,
      "TAAATC": 1037,
      "GGCCTGC": 1038,
      "GTTGTA": 1039,
      "GCCACCA": 1040,
      "GGGGCA": 1041,
      "GAGGGC": 1042,
      "GAGCGA": 1043,
      "TAATTC": 1044,
      "TGGGGC": 1045,
      "GTGACA": 1046,
      "GGGCCC": 1047,
      "GGTCAC": 1048,
      "TAATATT": 1049,
      "TAAATA": 1050,
      "GCTACA": 1051,
      "TCATTTT": 1052,
      "GTGGCA": 1053,
      "TACTTTT": 1054,
      "TTAGAA": 1055,
      "GTGTTC": 1056,
      "AACTC": 1057,
      "CCCTGC": 1058,
      "TGTGAC": 1059,
      "TACAAAA": 1060,
      "TTATTC": 1061,
      "GGAAAC": 1062,
      "GGCCGCC": 1063,
      "TGCTTTT": 1064,
      "TGAAATT": 1065,
      "GTACTT": 1066,
      "TAGCTT": 1067,
      "GATAAAA": 1068,
      "GCTGACC": 1069,
      "GGCTAC": 1070,
      "GTCCCC": 1071,
      "TGGTCC": 1072,
      "GATTAC": 1073,
      "GCTGTA": 1074,
      "GTATTTT": 1075,
      "GCCGGTC": 1076,
      "GCAGAC": 1077,
      "TATAAC": 1078,
      "TTATCC": 1079,
      "CACAAA": 1080,
      "GGACTT": 1081,
      "GTGGCGC": 1082,
      "GGGCTC": 1083,
      "TGCTGGC": 1084,
      "TGGGAA": 1085,
      "CCACCC": 1086,
      "TCGTCC": 1087,
      "TAGTAA": 1088,
      "TTATCAA": 1089,
      "TGGTTTT": 1090,
      "GGTATC": 1091,
      "GGCGCCC": 1092,
      "TTAACC": 1093,
      "GAATTC": 1094,
      "GACGGCC": 1095,
      "TCGTGC": 1096,
      "GACGGA": 1097,
      "TGATTC": 1098,
      "GGGGAA": 1099,
      "TAGATT": 1100,
      "AACTGC": 1101,
      "GAATCC": 1102,
      "TATAAAA": 1103,
      "TATCGA": 1104,
      "GACGATC": 1105,
      "GTTTCC": 1106,
      "GCATAA": 1107,
      "TGGTGGC": 1108,
      "TGATAAA": 1109,
      "TATCAAA": 1110,
      "GTATCA": 1111,
      "TGGTTA": 1112,
      "CACCCC": 1113,
      "GGGTTC": 1114,
      "GTCGCGC": 1115,
      "CCAGTT": 1116,
      "GGATCC": 1117,
      "TGATATT": 1118,
      "TGGGTG": 1119,
      "CCAACA": 1120,
      "TATACC": 1121,
      "GTATTC": 1122,
      "GACGCGC": 1123,
      "TCAGGC": 1124,
      "CCAACC": 1125,
      "GTATAA": 1126,
      "GACTGC": 1127,
      "TACTAC": 1128,
      "TATCAC": 1129,
      "GGGCGGC": 1130,
      "TCGTCA": 1131,
      "TGTGTC": 1132,
      "TTACCC": 1133,
      "GCGTAC": 1134,
      "GGACAC": 1135,
      "GCCGTGC": 1136,
      "TAATCC": 1137,
      "TGCGCCA": 1138,
      "GACGACC": 1139,
      "GGATAC": 1140,
      "GCCGCGA": 1141,
      "GGATTC": 1142,
      "TCGCCCA": 1143,
      "TGCAAAA": 1144,
      "TGCGCGC": 1145,
      "GCTGGAA": 1146,
      "TCAGAA": 1147,
      "TGGGG": 1148,
      "GAGGCA": 1149,
      "GCTATA": 1150,
      "TGGGCGC": 1151,
      "TGTTTC": 1152,
      "GTCGGCC": 1153,
      "TCTTTC": 1154,
      "CCACTT": 1155,
      "GTAGTA": 1156,
      "GATTTC": 1157,
      "GGGGTT": 1158,
      "TATGCA": 1159,
      "TAAGAA": 1160,
      "TTATAC": 1161,
      "TCAGCC": 1162,
      "TTCATC": 1163,
      "TTCAACA": 1164,
      "GCAGCAC": 1165,
      "CACCCA": 1166,
      "TCCACCA": 1167,
      "GATCACC": 1168,
      "TCTTCCA": 1169,
      "TTTTTTC": 1170,
      "GCGCCAA": 1171,
      "GTTGTC": 1172,
      "TTATAAA": 1173,
      "GTAGAA": 1174,
      "GCCGGGC": 1175,
      "AAACCA": 1176,
      "GGCGCTC": 1177,
      "TTATATT": 1178,
      "TATGAC": 1179,
      "TGAAGAA": 1180,
      "TCGCCAA": 1181,
      "TGGTCGA": 1182,
      "TCGAAC": 1183,
      "TTCACA": 1184,
      "TGAGGA": 1185,
      "GGCCGGC": 1186,
      "TTATGC": 1187,
      "TGAGAA": 1188,
      "GTTGCA": 1189,
      "TGGACAA": 1190,
      "GACTGG": 1191,
      "GTGGCGG": 1192,
      "GATGTA": 1193,
      "TTCAATT": 1194,
      "TAAAAAC": 1195,
      "AAATCA": 1196,
      "GCGTAA": 1197,
      "TAAAACC": 1198,
      "GCTGCAA": 1199,
      "GTACCC": 1200,
      "GTTGGC": 1201,
      "TCGGTC": 1202,
      "GCATTC": 1203,
      "TGCACCA": 1204,
      "TGAAACA": 1205,
      "GCAGGAA": 1206,
      "TACCAC": 1207,
      "TCCGGCA": 1208,
      "TACTAA": 1209,
      "GCAGTC": 1210,
      "TACGGC": 1211,
      "GCCGCTC": 1212,
      "GCTTTC": 1213,
      "GCAGGTC": 1214,
      "GCCCTGC": 1215,
      "GCGACCA": 1216,
      "GAGATA": 1217,
      "GCAGATC": 1218,
      "TATGGA": 1219,
      "GCTTAC": 1220,
      "GAAAACC": 1221,
      "TGGGTC": 1222,
      "GGGAAC": 1223,
      "TGGCGGC": 1224,
      "GAGTGC": 1225,
      "GCAGCAA": 1226,
      "TAAATTA": 1227,
      "AACAAAA": 1228,
      "TGGAACA": 1229,
      "GAAGCGC": 1230,
      "GCCGTCC": 1231,
      "GGTG": 1232,
      "TGGGGA": 1233,
      "GAAACAA": 1234,
      "AACGGC": 1235,
      "GCCCGGC": 1236,
      "TTTTCCA": 1237,
      "TGGGTA": 1238,
      "GTCACA": 1239,
      "GCGCCCA": 1240,
      "GCACAC": 1241,
      "TGCATC": 1242,
      "TGCTGCC": 1243,
      "TATTTAA": 1244,
      "GTCGCGG": 1245,
      "GTCGATC": 1246,
      "GAAATA": 1247,
      "TTCTCA": 1248,
      "TCCGCCA": 1249,
      "TGATGGC": 1250,
      "GGGGTC": 1251,
      "TGGGCGA": 1252,
      "GTTTAC": 1253,
      "GAAATC": 1254,
      "GCAGCGG": 1255,
      "GCGCCAC": 1256,
      "GAAAAAC": 1257,
      "CCCGGA": 1258,
      "TCGATCA": 1259,
      "TCCTCA": 1260,
      "GTTGCC": 1261,
      "TACACA": 1262,
      "AAATAC": 1263,
      "GTCGGA": 1264,
      "GCAGCTT": 1265,
      "TGATCAA": 1266,
      "GCAGCTC": 1267,
      "GCGTTA": 1268,
      "AACTTC": 1269,
      "GACGCCC": 1270,
      "TGCTGCA": 1271,
      "GCCTAC": 1272,
      "GCCGAAC": 1273,
      "TGTTCCA": 1274,
      "CCCAAA": 1275,
      "TGCGCGA": 1276,
      "GTTGGA": 1277,
      "TGATCGA": 1278,
      "GCAGCCA": 1279,
      "GGCGTGC": 1280,
      "TCCATC": 1281,
      "TTATCTT": 1282,
      "GCTCACC": 1283,
      "TAAAGAA": 1284,
      "GACTAC": 1285,
      "TGCTAA": 1286,
      "TCCTTTT": 1287,
      "GGCCGTC": 1288,
      "TGATGCC": 1289,
      "TGATGTT": 1290,
      "TCCAAAA": 1291,
      "GGCAAAA": 1292,
      "GCATTTT": 1293,
      "GATGAAA": 1294,
      "TTAGTA": 1295,
      "CCAATT": 1296,
      "TGACAC": 1297,
      "GACGGCA": 1298,
      "CCCTC": 1299,
      "GAATGG": 1300,
      "TTATGG": 1301,
      "GAGCGGC": 1302,
      "TGTGTA": 1303,
      "GGTACA": 1304,
      "GGCTGGC": 1305,
      "AACGCC": 1306,
      "TGCGTC": 1307,
      "GGCGGTC": 1308,
      "TCAATC": 1309,
      "GGATGCC": 1310,
      "GCGGTC": 1311,
      "AAAGTT": 1312,
      "TTATTTA": 1313,
      "GCAGCCC": 1314,
      "GGTGTA": 1315,
      "GAGCGCC": 1316,
      "GCGTGCC": 1317,
      "GAAAACA": 1318,
      "TGGCCCA": 1319,
      "TGGCACC": 1320,
      "GAATTTT": 1321,
      "TCAGCGC": 1322,
      "GTCGCCC": 1323,
      "TTCAACC": 1324,
      "TAGCCA": 1325,
      "GGATTTT": 1326,
      "GGCAACC": 1327,
      "GACACA": 1328,
      "TTCTTTA": 1329,
      "GCCCACC": 1330,
      "TCCCTT": 1331,
      "GGCACCA": 1332,
      "GTGTCC": 1333,
      "GCGGTGC": 1334,
      "GAGTAA": 1335,
      "TGGCAAA": 1336,
      "GAGTGG": 1337,
      "TGGTGAA": 1338,
      "GAAAATT": 1339,
      "GCATCAA": 1340,
      "TGGTGCC": 1341,
      "AAAATC": 1342,
      "GCCTGCC": 1343,
      "GAGTTA": 1344,
      "GCTGCCA": 1345,
      "GAAGATC": 1346,
      "GGTACC": 1347,
      "GGAGTA": 1348,
      "TGAGTA": 1349,
      "TCTTTAA": 1350,
      "GGTAAC": 1351,
      "GCGGCAC": 1352,
      "GACGTA": 1353,
      "TGCTGGA": 1354,
      "GTCGACC": 1355,
      "TGAAACC": 1356,
      "TGAGCC": 1357,
      "GTCTCC": 1358,
      "AAACAAA": 1359,
      "TCTTTTA": 1360,
      "TGGTGCA": 1361,
      "GCTGTTC": 1362,
      "GGTGGCC": 1363,
      "GCGCTC": 1364,
      "GGAGGC": 1365,
      "TTACAAA": 1366,
      "TACTA": 1367,
      "CACTC": 1368,
      "CCCGCC": 1369,
      "TCAGTA": 1370,
      "GGGTAA": 1371,
      "GGGACC": 1372,
      "GAATGA": 1373,
      "TGAATC": 1374,
      "GACGCGG": 1375,
      "TCGGCCC": 1376,
      "TGCTGTT": 1377,
      "GTGATC": 1378,
      "TCATTC": 1379,
      "CACCTT": 1380,
      "GCAACAA": 1381,
      "TATTTTC": 1382,
      "GCTTCCA": 1383,
      "GTCATC": 1384,
      "TCCTGCA": 1385,
      "TTTCAAA": 1386,
      "TAATTTA": 1387,
      "GCCGGAC": 1388,
      "GGCTGCC": 1389,
      "TGGTGTT": 1390,
      "TAAGTA": 1391,
      "GCACCCC": 1392,
      "GCTAAC": 1393,
      "GCCGACA": 1394,
      "GGCGGGC": 1395,
      "GTGAAAA": 1396,
      "GTGCTGC": 1397,
      "TGTTATT": 1398,
      "TATTATT": 1399,
      "TATGTC": 1400,
      "TGCACAA": 1401,
      "GAGCTGC": 1402,
      "GTTGAC": 1403,
      "TTCTTCC": 1404,
      "GCCGGAA": 1405,
      "TACTTA": 1406,
      "GAAGGCC": 1407,
      "GTGTGC": 1408,
      "GCAATC": 1409,
      "TAATTAA": 1410,
      "GCCACCC": 1411,
      "TGGTGGA": 1412,
      "TGCAACA": 1413,
      "GATTTTA": 1414,
      "TATTGTT": 1415,
      "AAATCC": 1416,
      "GTGTCA": 1417,
      "TTTTGTT": 1418,
      "GCCAACC": 1419,
      "GAAGCGG": 1420,
      "TGAAAAC": 1421,
      "GATGGCC": 1422,
      "GCGCCCC": 1423,
      "TGTTAAA": 1424,
      "TCACCCA": 1425,
      "GGGACA": 1426,
      "GCTTCAA": 1427,
      "GGTATA": 1428,
      "GCATAC": 1429,
      "TCTTTA": 1430,
      "GCCTCA": 1431,
      "GCAGTTC": 1432,
      "GTATCC": 1433,
      "GACCTGC": 1434,
      "GGTTTC": 1435,
      "GAGTAC": 1436,
      "TAACCC": 1437,
      "GAAGAAC": 1438,
      "GCCGTGG": 1439,
      "GACTCC": 1440,
      "GTCGGCA": 1441,
      "GGGGGC": 1442,
      "TGTTCTT": 1443,
      "TTTTAAAA": 1444,
      "GCCAAAA": 1445,
      "TGTTGTT": 1446,
      "TGGGCAA": 1447,
      "TTCGTA": 1448,
      "GCCGTTC": 1449,
      "TGTTTTA": 1450,
      "AACAACA": 1451,
      "GCAGGGC": 1452,
      "TACGTT": 1453,
      "GCTGGCA": 1454,
      "GCCGTCA": 1455,
      "TGCTGAA": 1456,
      "TCCGCGC": 1457,
      "TCAGCAA": 1458,
      "TGCTA": 1459,
      "TGGGAC": 1460,
      "TGATCCA": 1461,
      "GGCGCCA": 1462,
      "GCATCGA": 1463,
      "TGGACGA": 1464,
      "TTTATTA": 1465,
      "GAGTCC": 1466,
      "GCCGAGG": 1467,
      "TTTTTTAA": 1468,
      "GGGTCC": 1469,
      "GAAAAAAA": 1470,
      "TGCCGGA": 1471,
      "GCCTGCA": 1472,
      "TAATGG": 1473,
      "GCGATCA": 1474,
      "GACCACC": 1475,
      "GCGATGC": 1476,
      "GTTTTTC": 1477,
      "GATTTA": 1478,
      "GGGGAC": 1479,
      "AACTGG": 1480,
      "TGCCAAA": 1481,
      "TGTGGAA": 1482,
      "GCACCAC": 1483,
      "GCCGCTT": 1484,
      "TGATGCA": 1485,
      "TGGCTGC": 1486,
      "GGTTAC": 1487,
      "GGCTTTT": 1488,
      "GCGCTGG": 1489,
      "TATTTTTT": 1490,
      "GTCTGG": 1491,
      "TATTTCA": 1492,
      "GTGTAC": 1493,
      "GAGACA": 1494,
      "CCCGGCC": 1495,
      "GCAGGTT": 1496,
      "CCAGCGC": 1497,
      "GCTGAAA": 1498,
      "GCCTTTT": 1499,
      "TGTAATT": 1500,
      "TCCGGCC": 1501,
      "TAACAC": 1502,
      "GGCGTGG": 1503,
      "TGATCTT": 1504,
      "TCATCGA": 1505,
      "GCCGCGCC": 1506,
      "TAGGAA": 1507,
      "GCTAAAA": 1508,
      "TCACCCC": 1509,
      "TCGCTC": 1510,
      "GCAGCGCC": 1511,
      "GCGACGA": 1512,
      "TGCTCAA": 1513,
      "CCAGAA": 1514,
      "TACTCC": 1515,
      "TACTGG": 1516,
      "GGCGTTC": 1517,
      "TACGAC": 1518,
      "GATCGTC": 1519,
      "TAAATCA": 1520,
      "TAATGAA": 1521,
      "TCGGGC": 1522,
      "TAAAGTT": 1523,
      "AAACCC": 1524,
      "TTCGAA": 1525,
      "TGAGG": 1526,
      "TTCGGCA": 1527,
      "GCCGCAC": 1528,
      "GCCGCGGC": 1529,
      "TCGTCCA": 1530,
      "GAGAAAA": 1531,
      "GCACCCA": 1532,
      "GAGTGA": 1533,
      "TGCGGCA": 1534,
      "TGGCGGA": 1535,
      "TTACAC": 1536,
      "GACAAAA": 1537,
      "TGCAATT": 1538,
      "GCTGATC": 1539,
      "GTACAC": 1540,
      "GACGCA": 1541,
      "TTCGCCA": 1542,
      "TATTAAAA": 1543,
      "TATATTTT": 1544,
      "TTATTGA": 1545,
      "TCATCCA": 1546,
      "GGCTA": 1547,
      "TAACAAA": 1548,
      "CCAGGA": 1549,
      "GTGTGG": 1550,
      "GATTAAA": 1551,
      "TTCGGA": 1552,
      "GGCCGCGC": 1553,
      "GCCGCAA": 1554,
      "GCATCCA": 1555,
      "TGATTTA": 1556,
      "TCATTAA": 1557,
      "TCGATGC": 1558,
      "TCAAAC": 1559,
      "GCGTCGA": 1560,
      "GGCCTGG": 1561,
      "GCGGACC": 1562,
      "GTTTGG": 1563,
      "TGGCGG": 1564,
      "GTTTTAA": 1565,
      "TCGCCAC": 1566,
      "TGATTTC": 1567,
      "TCCGAC": 1568,
      "TGGAATT": 1569,
      "GTTAAC": 1570,
      "TCCGAA": 1571,
      "TCGACCC": 1572,
      "TAGCGC": 1573,
      "GCAGAAA": 1574,
      "TGACCAA": 1575,
      "GATGCCC": 1576,
      "TAGGTT": 1577,
      "GGCGTCC": 1578,
      "TAGTGA": 1579,
      "TACTCA": 1580,
      "TGCTTA": 1581,
      "TCGTGG": 1582,
      "GCCGAGC": 1583,
      "GATGACC": 1584,
      "TTCAC": 1585,
      "GTGGCCA": 1586,
      "GCAGCGA": 1587,
      "GGTCGTC": 1588,
      "GCATGGC": 1589,
      "GTTAAAA": 1590,
      "AAAGTA": 1591,
      "TAGTTA": 1592,
      "GAAATAA": 1593,
      "TCACCAA": 1594,
      "TGAGCAA": 1595,
      "GCCGGTT": 1596,
      "GGCACCC": 1597,
      "TGGTCAA": 1598,
      "GGTGACC": 1599,
      "GGCGCGGC": 1600,
      "GACAACC": 1601,
      "GCTGGCGC": 1602,
      "GCCTTCA": 1603,
      "TGGCATT": 1604,
      "GCCTGGC": 1605,
      "GAGAGC": 1606,
      "TCTGCC": 1607,
      "AAATTC": 1608,
      "TAGATA": 1609,
      "GTGTTTT": 1610,
      "GGCGAAC": 1611,
      "GGCCGAC": 1612,
      "GGCAACA": 1613,
      "TTATTTC": 1614,
      "TAAGGA": 1615,
      "GTCGCCA": 1616,
      "GTGGCGA": 1617,
      "AACTCC": 1618,
      "GCTGGAC": 1619,
      "AAATTTT": 1620,
      "TACGAA": 1621,
      "TTCTCCA": 1622,
      "TAAATTTT": 1623,
      "TAATTTC": 1624,
      "TATCTC": 1625,
      "TCAGCCA": 1626,
      "TGCCCCA": 1627,
      "GGTCACC": 1628,
      "GGAGAC": 1629,
      "GCCTTCC": 1630,
      "TTATGAA": 1631,
      "GGCGAGG": 1632,
      "TAATTCA": 1633,
      "TTTATTTT": 1634,
      "AACGAC": 1635,
      "TACTGA": 1636,
      "GTGCACC": 1637,
      "AACGTC": 1638,
      "GTTATC": 1639,
      "TCAGCTT": 1640,
      "TAGAAC": 1641,
      "GCAGGAC": 1642,
      "TATTGAA": 1643,
      "TGGGCCA": 1644,
      "TCCTGAA": 1645,
      "TCATCTT": 1646,
      "TATTCCA": 1647,
      "GAGTCA": 1648,
      "TGTCCAA": 1649,
      "TAGCGG": 1650,
      "TGGCCAC": 1651,
      "TTCTTTC": 1652,
      "TTCTTGA": 1653,
      "GCGATCC": 1654,
      "GAACACC": 1655,
      "TAGAAAA": 1656,
      "TCGATGA": 1657,
      "GTGTAA": 1658,
      "TGCAGGA": 1659,
      "TGGCGTT": 1660,
      "TGCTTCA": 1661,
      "GCAGACC": 1662,
      "TCAAAAC": 1663,
      "TCCTTA": 1664,
      "GAGAGG": 1665,
      "TCCTCCA": 1666,
      "TGGGCGG": 1667,
      "GGCTTCC": 1668,
      "TCTCTT": 1669,
      "TCCTTCA": 1670,
      "GATCAAC": 1671,
      "TGCTCCA": 1672,
      "GCAGGCA": 1673,
      "GACGTGC": 1674,
      "TGATGGA": 1675,
      "GCTCGTC": 1676,
      "GAAGCCC": 1677,
      "GGCCGGA": 1678,
      "TCAATAA": 1679,
      "GCTGCAC": 1680,
      "GCCTTA": 1681,
      "GGCGCTGC": 1682,
      "GCAGTG": 1683,
      "TGATTGA": 1684,
      "TCGTTC": 1685,
      "TTCTAAA": 1686,
      "TGTGAAA": 1687,
      "GCTGAAC": 1688,
      "GCTTCTT": 1689,
      "TGCCGTT": 1690,
      "CCATGC": 1691,
      "TGGTATT": 1692,
      "GAGCACC": 1693,
      "GGCTTA": 1694,
      "GCCAACA": 1695,
      "TCATAC": 1696,
      "TGTCATT": 1697,
      "GCGACCC": 1698,
      "GGCGGAA": 1699,
      "TCGATT": 1700,
      "TATGTA": 1701,
      "GGCGACA": 1702,
      "AACAATT": 1703,
      "GGAGATC": 1704,
      "GCACCAA": 1705,
      "TGCCGTC": 1706,
      "TGGTAAA": 1707,
      "TACAACA": 1708,
      "AACTAC": 1709,
      "TTCGCGC": 1710,
      "TAGCCC": 1711,
      "GGCGCTT": 1712,
      "TACCAAA": 1713,
      "TCGCTT": 1714,
      "TCAACCA": 1715,
      "TTCTGCA": 1716,
      "GTGTTA": 1717,
      "GGGTTA": 1718,
      "TCAGGAA": 1719,
      "TCCGTA": 1720,
      "TGATGAC": 1721,
      "TGTCACC": 1722,
      "TAAACTT": 1723,
      "GACGCCA": 1724,
      "AACTTTT": 1725,
      "TGATTAA": 1726,
      "GATTTAA": 1727,
      "AACTAA": 1728,
      "GGGAGA": 1729,
      "AAATGC": 1730,
      "GCGCGTC": 1731,
      "GGATGAA": 1732,
      "GGAGTC": 1733,
      "TATATAA": 1734,
      "TGTGGCA": 1735,
      "GGGATA": 1736,
      "GGCGGAC": 1737,
      "AACGTT": 1738,
      "TCTGGC": 1739,
      "TGTGGCC": 1740,
      "TGAGCTT": 1741,
      "TTCGCCC": 1742,
      "GGGTAC": 1743,
      "TCTCCA": 1744,
      "GGCGCGA": 1745,
      "GAAGACC": 1746,
      "AAATAAA": 1747,
      "TTGCCCA": 1748,
      "GGGCTGC": 1749,
      "GCAGCGGC": 1750,
      "GGTAAAA": 1751,
      "GTCTTTT": 1752,
      "GCGCCTT": 1753,
      "TGATTCA": 1754,
      "TATTTTAA": 1755,
      "GTTCACC": 1756,
      "GGCATCC": 1757,
      "TGAGCGC": 1758,
      "TGTGCCA": 1759,
      "TCGAAA": 1760,
      "TCGTCAA": 1761,
      "TTCTCTT": 1762,
      "GCCATCA": 1763,
      "GGGAGG": 1764,
      "TGGAACC": 1765,
      "TGCGAC": 1766,
      "GCCGCCGA": 1767,
      "GTTTTCA": 1768,
      "TGTTTTTT": 1769,
      "CCCGTC": 1770,
      "TAGTGC": 1771,
      "TATATTA": 1772,
      "TGAACCA": 1773,
      "AAACAC": 1774,
      "TTAATAA": 1775,
      "TGCGCAA": 1776,
      "GTAGTC": 1777,
      "GCATCTT": 1778,
      "TTGATAA": 1779,
      "GCTCGAC": 1780,
      "GCCGGGG": 1781,
      "GCAGATT": 1782,
      "TGCAACC": 1783,
      "GTGGCCC": 1784,
      "GGCCCCC": 1785,
      "AACGAA": 1786,
      "GAAACCA": 1787,
      "TATCAAAA": 1788,
      "TGGATCA": 1789,
      "TCTGCA": 1790,
      "TCGGTGA": 1791,
      "GTTGATC": 1792,
      "GTCACCA": 1793,
      "GGCGATT": 1794,
      "GCCTA": 1795,
      "GCGTTCC": 1796,
      "GTATGC": 1797,
      "GGAGCGC": 1798,
      "GAATATT": 1799,
      "GGCGGCCA": 1800,
      "GCTGCTT": 1801,
      "TCTATT": 1802,
      "GGATGGC": 1803,
      "TTCAAAAA": 1804,
      "GGCGCAC": 1805,
      "TCACAC": 1806,
      "TCCGCCC": 1807,
      "GCATTAA": 1808,
      "GATGAAC": 1809,
      "GATCAAA": 1810,
      "TTCGGCC": 1811,
      "GCCAGCGC": 1812,
      "GTTTTTA": 1813,
      "GGGCGTC": 1814,
      "GGCTTCA": 1815,
      "GATCTGC": 1816,
      "GACGAAC": 1817,
      "TAAAGTA": 1818,
      "TAGTTC": 1819,
      "AACAACC": 1820,
      "GAAATTA": 1821,
      "GAATTAA": 1822,
      "TGACAAA": 1823,
      "TGGCCTT": 1824,
      "TCTTTCA": 1825,
      "GTCAAAA": 1826,
      "TCTACC": 1827,
      "GT": 1828,
      "TGCGGCC": 1829,
      "CACCA": 1830,
      "GCCGCTGC": 1831,
      "GGCGTCA": 1832,
      "AACTGA": 1833,
      "TTCTATT": 1834,
      "TCGCCCC": 1835,
      "TGCGCCC": 1836,
      "GGCGGTT": 1837,
      "GAAGATT": 1838,
      "GAACAAA": 1839,
      "GGAGCGG": 1840,
      "GGCATCA": 1841,
      "TCTTCAC": 1842,
      "GTAAAAAA": 1843,
      "GCCGAAA": 1844,
      "TACAACC": 1845,
      "TAATCAA": 1846,
      "GCGCGCGC": 1847,
      "TAAACCA": 1848,
      "GTGCCAA": 1849,
      "GCGACAA": 1850,
      "TGCTAC": 1851,
      "TTGACCA": 1852,
      "GACGGTC": 1853,
      "TATTACC": 1854,
      "GCGAAAA": 1855,
      "GAAGGAA": 1856,
      "CCACCCC": 1857,
      "GGATATT": 1858,
      "TCTGTT": 1859,
      "GCAAAAC": 1860,
      "TGACCCA": 1861,
      "GCCGCCCA": 1862,
      "GGTGCCC": 1863,
      "TGCGCGG": 1864,
      "CACAAC": 1865,
      "TTCTGTT": 1866,
      "TGGACCA": 1867,
      "TCGGTCA": 1868,
      "GCCGCGCA": 1869,
      "TGGGA": 1870,
      "TTACCAA": 1871,
      "GGAGAAA": 1872,
      "TCCAACA": 1873,
      "TTATTAAA": 1874,
      "TGGGTGA": 1875,
      "TCTAAA": 1876,
      "TACGTC": 1877,
      "GCATGCC": 1878,
      "GACGTG": 1879,
      "TCACCTT": 1880,
      "TGCGTA": 1881,
      "TGGATGA": 1882,
      "GCTTCAC": 1883,
      "TCCGCGA": 1884,
      "CCCAAC": 1885,
      "GCCGATT": 1886,
      "TTATTCA": 1887,
      "TCGCGGC": 1888,
      "GAAGTG": 1889,
      "TTTTTGA": 1890,
      "GCGAACC": 1891,
      "TTGATGA": 1892,
      "GCGTGCA": 1893,
      "TTTATAA": 1894,
      "GCACCTT": 1895,
      "TCTCCC": 1896,
      "GTTGCGC": 1897,
      "GTTTATT": 1898,
      "TGGCACA": 1899,
      "TAGGCA": 1900,
      "GGCGAAA": 1901,
      "TACGG": 1902,
      "GCGTGAA": 1903,
      "TCCTAA": 1904,
      "CCCGCA": 1905,
      "GGAAACC": 1906,
      "TGTGCAA": 1907,
      "GTCCACC": 1908,
      "TTCACCA": 1909,
      "GATGGAA": 1910,
      "GCTGTCC": 1911,
      "GCCTGAA": 1912,
      "GAAGCAA": 1913,
      "GGCCTTC": 1914,
      "GGGCAAA": 1915,
      "AAAATAA": 1916,
      "AC": 1917,
      "GGCGGCGA": 1918,
      "GGATCGA": 1919,
      "TACAATT": 1920,
      "GCGGCTT": 1921,
      "TAGATC": 1922,
      "TATCAAC": 1923,
      "TTAGAAA": 1924,
      "GTAAATT": 1925,
      "GGGCCAC": 1926,
      "GCATCAC": 1927,
      "TGGATGC": 1928,
      "GTTTCTT": 1929,
      "GGCGAGC": 1930,
      "GGGAGC": 1931,
      "TCCTCGA": 1932,
      "CCCGCGC": 1933,
      "GGCTAA": 1934,
      "TCATCAC": 1935,
      "TGGGCTT": 1936,
      "TTTTGAA": 1937,
      "TCGGTGC": 1938,
      "GTGGTGC": 1939,
      "AAAAAAC": 1940,
      "GGAAAAC": 1941,
      "GTGGCAA": 1942,
      "GTAACAA": 1943,
      "TCGGTT": 1944,
      "GGCGCAA": 1945,
      "TAGTCA": 1946,
      "TTTTTCTT": 1947,
      "TGACCTT": 1948,
      "TCCTTGA": 1949,
      "GGGCCGG": 1950,
      "GCCTGTT": 1951,
      "GGCGGCGG": 1952,
      "AAATGA": 1953,
      "GACGACA": 1954,
      "GCCGGCCA": 1955,
      "TTCGACC": 1956,
      "GATTATT": 1957,
      "TATTCAA": 1958,
      "GTCTAC": 1959,
      "TGGTTCA": 1960,
      "GGAGGAA": 1961,
      "GACTTA": 1962,
      "AAAGAAA": 1963,
      "GACGAGG": 1964,
      "GCCCGCGC": 1965,
      "TGAACTT": 1966,
      "TTTTTGC": 1967,
      "CCCGTT": 1968,
      "GATCATC": 1969,
      "AAATATT": 1970,
      "TAAATAC": 1971,
      "TGGGTGC": 1972,
      "GGCGGGG": 1973,
      "TCCGCAA": 1974,
      "TCCAACC": 1975,
      "TTCAAAC": 1976,
      "TGCTCGA": 1977,
      "GGGCACC": 1978,
      "TGAAGTT": 1979,
      "GCCTCCA": 1980,
      "CCCGAA": 1981,
      "GCGGTGA": 1982,
      "GCGAACA": 1983,
      "TCCTAC": 1984,
      "GCCGTGA": 1985,
      "GGCACAA": 1986,
      "GCACACC": 1987,
      "GTGGTGG": 1988,
      "TGCGCTT": 1989,
      "GAACCCC": 1990,
      "TCATATT": 1991,
      "TCAATA": 1992,
      "GTTCTTC": 1993,
      "TTTTTTCA": 1994,
      "GCGATGA": 1995,
      "GACAACA": 1996,
      "TCCTGCC": 1997,
      "GTTACAA": 1998,
      "GTCGAGG": 1999,
      "GGCTGAA": 2000,
      "TAATGTT": 2001,
      "GCAGAAC": 2002,
      "GCTCAAC": 2003,
      "TGCGAA": 2004,
      "TGGAGGA": 2005,
      "GTCGTGC": 2006,
      "GGGCTGG": 2007,
      "TAATCTT": 2008,
      "GCCGCCGG": 2009,
      "TTTACCA": 2010,
      "GCTGATT": 2011,
      "GTCGTG": 2012,
      "GTCGTCC": 2013,
      "TATTACA": 2014,
      "GATGGCA": 2015,
      "TCATAAA": 2016,
      "TGGAAAAA": 2017,
      "GGCCGCCA": 2018,
      "TGTACAA": 2019,
      "GCAAAAAA": 2020,
      "TTCGCGG": 2021,
      "TCAGCAC": 2022,
      "TCACCAC": 2023,
      "TGGTCTT": 2024,
      "TGACCCC": 2025,
      "TTCTGAA": 2026,
      "TGTGATT": 2027,
      "GCAGTGC": 2028,
      "GGCTGCA": 2029,
      "TCCTCAA": 2030,
      "TGCCGCGC": 2031,
      "GGCGTGA": 2032,
      "TCGGAC": 2033,
      "TTACCTT": 2034,
      "GAAGGTC": 2035,
      "GGACACC": 2036,
      "GGATCAA": 2037,
      "TAAGAAA": 2038,
      "TAGACA": 2039,
      "GGCTGGA": 2040,
      "TTATTAC": 2041,
      "CACTGC": 2042,
      "TGATGTC": 2043,
      "TCCTGTT": 2044,
      "CCCGAC": 2045,
      "GATGATC": 2046,
      "TAGTGG": 2047,
      "GCGGGCGC": 2048,
      "TTGCAAA": 2049,
      "TATAAAAA": 2050,
      "GATCGAC": 2051,
      "TAGACC": 2052,
      "GGCCGCCC": 2053,
      "GTTTTCC": 2054,
      "TAATATA": 2055,
      "GAGCAGG": 2056,
      "TGTCATC": 2057,
      "TGCCGAA": 2058,
      "GTCGAAC": 2059,
      "TTAGCA": 2060,
      "TTTCTTTT": 2061,
      "GTTGATT": 2062,
      "TCATGAA": 2063,
      "TAATAAAA": 2064,
      "GGCCAAC": 2065,
      "TCAGAAA": 2066,
      "TGGTGAC": 2067,
      "TTCTGGC": 2068,
      "TCGCAA": 2069,
      "GAGCCGG": 2070,
      "GAATAAA": 2071,
      "GCAAATT": 2072,
      "TGGGCGGC": 2073,
      "TAGCAC": 2074,
      "TATCTTTT": 2075,
      "GCGTCAA": 2076,
      "TGGTTGA": 2077,
      "GCCAAAC": 2078,
      "TAGCTC": 2079,
      "TTAGA": 2080,
      "GCGCAAC": 2081,
      "GTTGAAA": 2082,
      "TTTTTAC": 2083,
      "TGCCCTT": 2084,
      "TTCGTCA": 2085,
      "GAAGCCA": 2086,
      "GACGCTC": 2087,
      "TGCCCCC": 2088,
      "TATAATT": 2089,
      "GCTGTGC": 2090,
      "TCTGAA": 2091,
      "GTAATAA": 2092,
      "TAGCGA": 2093,
      "TGAGAAA": 2094,
      "GTTCAAA": 2095,
      "TAAATATT": 2096,
      "TTCGTG": 2097,
      "TCGAGGA": 2098,
      "GGCGCGCA": 2099,
      "GAATTTC": 2100,
      "TGATCGCC": 2101,
      "TATGAAA": 2102,
      "GAGGCCA": 2103,
      "GTGACCA": 2104,
      "TCCTGGC": 2105,
      "TCGCGA": 2106,
      "GGGCAAC": 2107,
      "GTTTCAA": 2108,
      "GGCTTTC": 2109,
      "CCCGCCC": 2110,
      "TGCCACA": 2111,
      "GCATCGCC": 2112,
      "GAAGGCA": 2113,
      "TTTTTATT": 2114,
      "GCATATT": 2115,
      "GAGGCGG": 2116,
      "GCATGAA": 2117,
      "TCTTAAA": 2118,
      "TGATCCC": 2119,
      "GATTCCA": 2120,
      "TGCTTGA": 2121,
      "TGAGTC": 2122,
      "TCATGGC": 2123,
      "GGCAATT": 2124,
      "TCAGTC": 2125,
      "TTCTTAA": 2126,
      "GCGTCCA": 2127,
      "TTGGAAA": 2128,
      "GCAACCA": 2129,
      "GAACAAC": 2130,
      "TAAAGAAA": 2131,
      "GCCTTGA": 2132,
      "TTTTTCC": 2133,
      "GGATTTC": 2134,
      "TGGTCGG": 2135,
      "GCATCGG": 2136,
      "TGGTTTC": 2137,
      "TTCTCAA": 2138,
      "TGTGGTT": 2139,
      "TGAGCCA": 2140,
      "TCTCAA": 2141,
      "TTTTTTTA": 2142,
      "GCCTCGA": 2143,
      "GCCGACCA": 2144,
      "TTATATA": 2145,
      "GGAAGAA": 2146,
      "GATGATT": 2147,
      "GTGGATC": 2148,
      "GCTTTAA": 2149,
      "TGCCATT": 2150,
      "GTATCAA": 2151,
      "GATAATT": 2152,
      "GCAGCACC": 2153,
      "TACTTCA": 2154,
      "GTTTGTT": 2155,
      "GTGAACA": 2156,
      "GTAAAAC": 2157,
      "GCCTGGA": 2158,
      "TCCAATT": 2159,
      "TGCATCA": 2160,
      "GCATTTC": 2161,
      "TTATCCA": 2162,
      "GATTTCA": 2163,
      "TGCGCTC": 2164,
      "CACGTT": 2165,
      "GTTAATT": 2166,
      "TGATCGGC": 2167,
      "TGGCAAC": 2168,
      "GCGCGGCC": 2169,
      "CACGTC": 2170,
      "GAAGTGC": 2171,
      "GGGAAAA": 2172,
      "GGTCAAC": 2173,
      "GACCGGC": 2174,
      "GTATTAA": 2175,
      "GGATGTC": 2176,
      "GTATGA": 2177,
      "GGGCGAC": 2178,
      "CCATAA": 2179,
      "GGGGTA": 2180,
      "GAAGTTC": 2181,
      "TGTGCTT": 2182,
      "GCATCCC": 2183,
      "GTTTGAA": 2184,
      "TACATC": 2185,
      "TGTTTTAA": 2186,
      "GGTGATC": 2187,
      "TTTATCA": 2188,
      "TTAGGA": 2189,
      "TACGGA": 2190,
      "GAGGCCC": 2191,
      "TGGTCCA": 2192,
      "GCTCATC": 2193,
      "TTCTGGA": 2194,
      "TCGATCC": 2195,
      "TGATCGG": 2196,
      "GTCACCC": 2197,
      "TAGAGA": 2198,
      "GCTCAAA": 2199,
      "GAACTGC": 2200,
      "GCGTTTT": 2201,
      "GGTGAAA": 2202,
      "TGGGGCA": 2203,
      "GCGGTCA": 2204,
      "GGCTGTT": 2205,
      "TACACCA": 2206,
      "TCGGAA": 2207,
      "GATTCAA": 2208,
      "CACTTC": 2209,
      "GACGTCC": 2210,
      "TTTTTCAA": 2211,
      "GCATCGC": 2212,
      "TCTATC": 2213,
      "TCAAACA": 2214,
      "TTACCCA": 2215,
      "GATTTTC": 2216,
      "GGAGGCC": 2217,
      "TGGAAAC": 2218,
      "TGCCACC": 2219,
      "GCGGAAC": 2220,
      "GGCGCGCC": 2221,
      "CACGCCC": 2222,
      "TTAAAAC": 2223,
      "GATGTTC": 2224,
      "GTTTAAA": 2225,
      "TGAATAA": 2226,
      "TGTTGAA": 2227,
      "TAGAGC": 2228,
      "AAAACCA": 2229,
      "AAAGGA": 2230,
      "TTCATCA": 2231,
      "TGCCGAC": 2232,
      "TCCATCA": 2233,
      "TACGCC": 2234,
      "TAGGCC": 2235,
      "GTTCAAC": 2236,
      "TGACCAC": 2237,
      "TAAAAACA": 2238,
      "GTCAACC": 2239,
      "TAGAGG": 2240,
      "GGGTGCC": 2241,
      "GGCCCCA": 2242,
      "TCGTGA": 2243,
      "GAAGCTT": 2244,
